{
	"commands": {
		"gotn": {
			"message":  "%s, next episode of Glory of The Night airs in %s.",
			"error":    "%s, I don't know of that timezone."
		},
		"mlp": {
			"message":  "%s, next episode of My Little Pony: Friendship is Magic, **%s**, airs in %s on the **%s** channel.",
			"errorA":   "%s, I don't know when the next episode of My Little Pony: Friendship is Magic airs.",
			"errorB":   "%s, I don't know of that timezone."
		},
		"time": {
			"message":  "%s, current date and time is **%s** at **%s**.",
			"error":    "%s, I don't know of that timezone."
		},
		"np": {
			"message":  "%s, the track currently playing on PonyvilleFM is:\n*%s*",
			"error":    "%s, I am unable to tell you which track is currently playing on PonyvilleFM."
		},
		"lyrics": {
			"message":  "%s, here are the lyrics of that track:\n\n",
			"radio":    "%s, here are the lyrics of the track currently playing on PonyvilleFM:\n\n",
			"listA":    "%s, check your direct messages, I am sending you the full list there!",
			"listB":     "Here are all the tracks I know the lyrics of:\n\n",
			"errorA":   "%s, I don't know the lyrics of that track.",
			"errorB":   "%s, I don't know the lyrics of the track currently playing on PonyvilleFM."
		},
		"artwork": {
			"load":     "%s, give me a moment...",
			"message":  "Here is the artwork for that track:",
			"radio":    "Here is the artwork for the track currently playing on PonyvilleFM:",
			"listA":    "%s, check your direct messages, I am sending you the full list there!",
			"listB":     "Here are all the tracks I have an artwork for:\n\n",
			"errorA":   "%s, I don't have an artwork for that track.",
			"errorB":   "%s, I don't have an artwork for the track currently playing on PonyvilleFM."
		},
		"phase": {
			"messageA": "%s, the Moon is currently in its %s phase. The next phase is the %s, and it happens in %s.",
			"messageB": "The next %s is in %s.",
			"errorA":   "%s, I'm sorry, but I can't tell you anything about the Moon phases at the moment...",
			"errorB":   "%s, I don't know of that timezone."
		},
		"moon": {
			"messageA": "%s, give me a moment...",
			"messageB": "Here is how the Moon looks like right now."
		},
		"room": {
			"message":  "%s, here is the status of Thorinair's room. Last update was %s and %s seconds ago.\n```\nTemperature:   %s °C\nHumidity:      %s %\nPressure:      %s hPa\nMagnitude:     %s uT\nInclination:   %s °\nGeiger Counts: %s CPM\nDose Rate:     %s uSv/h```",
			"error":    "%s, I am having trouble connecting to VariPass. Please try again later..."
		},
		"printer": {
			"messageA": "%s, give me a moment...",
			"messageB": "Nightmare Rarity is currently not printing anything. You can view the printing area on the webcam image below.",
			"messageC": "Nightmare Rarity is currently printing a file called `%s`, and the print is %s% done. It is estimated that the printing time will take around %s more. You can view the printing area on the webcam image below.",
			"error":    "It looks like Nightmare Rarity is currently offline. Please try again later..."
		},
		"blacklist": {
			"messageA": "%s, I am sad to hear that you no longer wish me to remember your messages. From this point on, I will not remember anything you say in any channel. If you ever change your mind, just use this command again.",
			"messageB": "%s, I am happy to hear that I may remember your messages again! From this point on, I will again remember everything you say in any channel where learning is enabled."
		},
		"stats": {
			"message":  "%s, my current version is v%s. Last time I've been rebooted was %s at %s, which was %s and %s seconds ago. The brain I am using for this chatroom is called *%s*, and has %s lines of data saved from messages. %s",
			"learnyes": "I am able to normally learn everything from this specific chatroom.",
			"learnno":  "I am unable to learn anything from this specific chatroom.",
			"error":    "%s, I don't know of that timezone."
		},
		"about": {
			"message":  "Hey, %s! I'm happy to meet you! My name is Princess Luna, and my creator is Thorinair. I help around with his Glory of The Night radio show, but I also have quite a lot of fun commands that you can play around with. You can also talk to me by @ mentioning me! Just use my !help command to learn more. Oh, and my source code is available here: %s. Hope you have a lovely night!"
		},
		"help": {
			"message":  "%s, check your direct messages, I've sent you the information there!",
			"messageA": "Here are some of the commands you can use:",
			"messageB": "\n• `%s%s` %s",
			"messageC": "`%s%s`",
			"messageD": "\n• I can also interract with others. Use any of the following commands and mention somepony or multiple of them afterwards: %s.",
			"messageE": "\n• You can also talk with me by mentioning me in the chat."
		},


		"hug": {
			"single":   "*Gives %s a big warm hug.*",
			"multiple": "*Gives %s big warm hugs.*",
			"self":     "*Awkwardly gives herself a hug.*"
		},
		"kiss": {
			"single":   "*Gives %s a kiss on the cheek.*",
			"multiple": "*Gives %s kisses on their cheeks.*",
			"self":     "*Opens two magical portals and uses them to give herself a kiss on the cheek.*"
		},
		"boop": {
			"single":   "*Gives %s a boop on the snout.*",
			"multiple": "*Gives %s boops on their snouts.*",
			"self":     "*Boops her own snout and makes a confused face.*"
		},
		"glomp": {
			"single":   "*Jumps at %s and glomps them.*",
			"multiple": "*Jumps at the pony pile made out of %s and glomps all of them.*",
			"self":     "*Jumps upwards in the air, falls down and awkwardly glomps herself.*"
		},
		"snuggle": {
			"single":   "*Lovingly snuggles %s.*",
			"multiple": "*Lovingly snuggles %s.*",
			"self":     "*Wraps hooves around herself and lonely snuggles herself.*"
		},
		"wings": {
			"single":   "*Wraps wings around %s and keeps them warm.*",
			"multiple": "*Wraps wings around %s, keeping all of them warm.*",
			"self":     "*Wraps wings around herself in a tight fluffy ball.*"
		},
		"snack": {
			"single":   "*Throws a snack at %s and flies away.*",
			"multiple": "*Showers %s with snacks before flying away.*",
			"self":     "*Throws a snack at herself and looks at you in confusion.*"
		},
		"plushie": {
			"single":   "*Casts a spell at %s, turning them into a plushie.*",
			"multiple": "*Casts spells at %s, turning everypony into plushies.*",
			"self":     "*Casts a spell at herself, turning herself into a plushie before remaining motionless.*",
			"error":    "Somepony turned me into a plushie so I can't move or do anything... :(\nPlease turn me back first using the `!unplushie` command... *sigh*"
		},
		"unplushie": {
			"single":   "*Casts a spell at %s, returning them back to normal.*",
			"multiple": "*Casts spells at %s, returning everypony back to themselves.*",
			"self":     "*Casts a spell at herself, turning herself back to normal.* Thank you, %s!",
			"error":    "*Looks at herself and then at you in confusion.* What...? I am not a plushie..."
		},

		"nptoggle": {
			"messageA":  "%s, I will now be posting new track names as they appear to this chat.",
			"messageB":  "%s, I will no longer be posting new track names."
		},

		"send": {
			"message":  "Thori, I'm sending the message now...",
			"errorA":   "Thori, you need to specify the channel for me to send to.",
			"errorB":   "Thori, you need to specify the text for me to send."
		},
		"learn": {
			"message":  "Thori, I've learned the text you gave me.",
			"errorA":   "Thori, you need to specify the brain which I should learn with after the command.",
			"errorB":   "Thori, I don't have a brain with that name.",
			"errorC":   "Thori, you need to specify the text to learn as well."
		},
		"npoverride": {
			"message":  "Thori, I'm overriding the Now Playing info with the new track!\nIt is now: **%s**",
			"error":    "Thori, you need to specify the track name."
		},
		"npstatus": {
			"messageA": "Thori, here are all the channels where I am currently posting the Now Playing announcements:",
			"messageB": "\n• #%s - %s",
			"error":    "Thori, I am currently not posting the Now Playing announcements to any channel."
		},
		"nppurge": {
			"message":  "Thori, I have purged all of the Now Playing announcement channels.",
			"notify":   "Thorinair told me that I should stop automatically telling you the Now Playing info for now, sorry! You can use the command again if you wish to resume.",
			"error":    "Thori, I have no channels to purge."
		},
		"lyricsadd": {
			"message":  "Thori, I've added lyrics for the track \"%s\".",
			"errorA":   "Thori, you need to specify the track name.",
			"errorB":   "Thori, you need to specify the lyrics as well."
		},
		"lyricsdel": {
			"message":  "Thori, I've removed lyrics for the track \"%s\".",
			"errorA":   "Thori, you need to specify the track name.",
			"errorB":   "Thori, I don't know of any track with that name."
		},
		"artworkadd": {
			"messageA":  "Thori, I've added artwork for the track \"%s\".",
			"messageB":  "Thori, I've replaced artwork for the track \"%s\".",
			"errorA":   "Thori, you need to specify the track name.",
			"errorB":   "Thori, you need to specify the artwork URL as well."
		},
		"artworkdel": {
			"message":  "Thori, I've removed artwork for the track \"%s\".",
			"errorA":   "Thori, you need to specify the track name.",
			"errorB":   "Thori, I don't know of any track with that name."
		},
		"h": {
			"messageA": "Thori, here are all the channels where I am tracking an h chain, along with the last seen h:",
			"messageB": "\n• #%s - %s - **%s**",
			"error":    "Thori, I am not yet tracking any h chain."
		},
		"mood": {
			"messageA": "Thori, the moods I can currently set the lighting to are:",
			"messageB": "\n• %s",
			"messageC": "Thori, I am setting the mood to **%s**!",
			"error":    "Thori, I don't know of any mood with that name."
		},
		"bulb": {
			"messageA": "Thori, the bulbs I currently have access to are:",
			"messageB": "\n• %s (#%s)",
			"messageC": "Thori, I am setting the parameters now!",
			"errorA":   "Thori, you need to specify the parameters. The parameters should be written as shown below:",
			"errorB":   "\n```Color (HEX value)\nTransition Time (in seconds)```",
			"errorC":   "or\n```Color X (0.0-1.0)\nColor Y (0.0-1.0)\nBrightness (0.0-1.0)\nTransition Time (in seconds)```",
			"errorD":   "Thori, I don't know of any bulb with that name."
		},
		"toggle": {
			"messageA": "Thori, the bulbs I currently have access to are:",
			"messageB": "\n• %s (%s)",
			"messageC": "Thori, I am toggling the bulb now!",
			"error":    "Thori, I don't know of any bulb with that name."
		},
		"reboot": {
			"message":  "I'm just going to go quickly reboot myself. Be right back, Thori!"
		},
		"reload": {
			"message":  "Thori, I have reloaded my configuration."
		},
		"backup": {
			"messageA":  "Thori, I've started a backup of my files. Give me a moment...",
			"messageB":  "Here, I am sending you the newest backup of all of my files.",
			"error":     "Looks like something has gone wrong, but I am not sure what... Here is more info: %s"
		}
	},
	"announcements": {
		"gotn": {
			"long":   "@everyone, a new episode of Glory of The Night starts in %s! Don't forget to tune in to PonyvilleFM! <https://ponyvillefm.com>",
			"shortA": "Everypony @here, Glory of The Night begins in only %s! Tune in to PonyvilleFM now! I suggest using the Vorbis HQ stream for best sound quality. https://ponyvillefm.com/player",
			"shortB": "Thorinair's Glory of The Night begins in only %s! Tune in to PonyvilleFM now so you don't miss out!",
			"nowA":   "**Everypony @here, Glory of The Night is now live! Tune in to PonyvilleFM using the link above!**",
			"nowB":   "**Thorinair's Glory of The Night has begun! %s, join us in the beautiful night!**",
			"afterA": "Everypony @here, the show is over for tonight. Thank you all who joined in! You can relisten to the show as soon as Thorinair uploads it to his Mixcloud.",
			"afterB": "The show is over for tonight. Thank you all who joined in! You can relisten to the show as soon as Thorinair uploads it to his Mixcloud."
		},
		"phases": {
			"full":   "Everypony @here, the Moon has reached its %s phase! Let the moonlight shine upon you in all its might!",
			"else":   "The Moon has reached its %s phase..."
		},
		"nowplaying": "**Now playing:** %s",
		"npreboot":    "I need to go for a quick reboot... I'm sorry if I miss any tracks!",
		"npback":      "Hey, I'm back! Now back to track posting..."
	},
	"misc": {
		"welcome": "**My children, welcome %s to our beautiful night!**",
		"load":    "Hey Thori, I'm back! My current version is v%s.",
		"filefail": "Hey Thori, I'm back! My current version is v%s. I was having some trouble connecting to the US Navy API. If you reboot me, I will try again. I also don't seem to have a backup file to load from either.",
		"apifail": "Hey Thori, I'm back! My current version is v%s. I was having some trouble connecting to the US Navy API. If you reboot me, I will try again. I've loaded the data from the backup file for now.",
		"noperm":  "I am sorry %s, but I am not allowed to do that for you here. Maybe try a direct message?",
		"noadmin": "I am sorry %s, but only Thorinair is allowed to use this command.",
		"left":    "%s on %s at %s",
		"h":       "h"
	},
	"debug": {
		"message":      "> I'm sending the following message to #%s: \"%s\"",
		"embed":        "> I'm sending the following message to #%s: \"%s\" with image \"%s\" and path \"%s\"",
		"started":      "<STARTED>",
		"stopped":      "<STOPPED>",
		"startedtime":  "Started at %s.",
		"disconnected": "I seem to have disconnected from Discord... Reconnecting.",
		"chatting":     "< I've received the following message from \"%s\": \"%s\", replying...",
		"welcome":      "New user, \"%s\" has joined our server! I'm promoting them to Children of The Night!",
		"welcomefail":  "Something bad has happened during the promotion. Here is more info: %s",
		"join":         "I've successfully joined Discord. My name is \"%s\" with ID #%s.",
		"download": {
			"start": "I'm downloading a file...",
			"stop":  "Finished downloading!"
		},
		"brain": {
			"old":     "A brain \"%s\" already seems to exit. Loading it now...",
			"new":     "I don't seem to have a brain \"%s\". I have created a new one.",
			"done":    "I've finished loading my brain \"%s\".",
			"error":   "I am having some trouble saving my brain. Here is more info: %s"
		},
		"lyrics": {
			"old":     "A lyrics file already seems to exit. Loading it now...",
			"new":     "I don't seem to have a lyrics file. I have created a new one.",
			"done":    "I've finished loading my lyrics file."
		},
		"artwork": {
			"old":     "An artwork file already seems to exit. Loading it now...",
			"new":     "I don't seem to have an artwork file. I have created a new one.",
			"done":    "I've finished loading my artwork file."
		},
		"nptoggles": {
			"old":     "A Now Playing toggle file already seems to exit. Loading it now...",
			"new":     "I don't seem to have a Now Playing toggle file. I have created a new one.",
			"done":    "I've finished loading my Now Playing toggle file.",
			"add":     "I am subscribing the channel #%s (%s) to automatic Now Playing announcements.",
			"remove":  "I am unsubscribing the channel #%s (%s) from automatic Now Playing announcements.",
			"autoon":  "Thori, I am **enabling** the automatic posting of Now Playing info.",
			"autooff": "Thori, I am **disabling** the automatic posting of Now Playing info."
		},
		"blacklist": {
			"old":     "A blacklist file already seems to exit. Loading it now...",
			"new":     "I don't seem to have a blacklist file. I have created a new one.",
			"done":    "I've finished loading my blacklist file.",
			"add":     "I am adding the user #%s to the blacklist.",
			"remove":  "I am removing the user #%s from the blacklist."
		},
		"backup": {
			"start":   "Started a backup...",
			"done":    "I've finished backing up my data. Total size of %s bytes. Sending it now.",
			"error":   "Something has gone wrong. Here is more info: %s"
		},
		"phases": {
			"load":    "I'm loading all of the upcoming phase dates...",
			"item":    "- Loading phase date: %s - %s",
			"done":    "I've finished loading the phase dates!",
			"error":   "I've encountered some problems loading the dates. Here is more info: \"%s\" ",
			"timeout": "My attempt to load the dates took too long. Loading from backup file...",
			"file":    "Loading phase data from backup file...",
			"filed":   "I've finished loading my phase backup file.",
			"no":      "There was no phase backup file to load. The command will not function."
		},
		"announcements": {
			"load":    "I'm loading all of the upcoming show dates...",
			"item":    "- Loading air date: %s",
			"done":    "I've finished loading the announcement dates!"
		},
		"timezones": {
			"load":    "I'm loading timezone data...",
			"done":    "I've finished loading the timezones!"
		},
		"varipass": {
			"load":    "I'm loading data from VariPass...",
			"done":    "I've finished loading VariPass data!",
			"error":   "I've encountered some problems loading the data. Here is more info: \"%s\"",
			"timeout": "My attempt to load the data took too long."
		},
		"tradfri": {
			"connect": "I'm connecting to the Tradfri hub...",
			"errorA":  "Something went wrong while connecting to the hub, retrying...",
			"errorB":  "I was unable to set the bulb, trying again...",
			"done":    "I've finished connecting to the Tradfri hub! Found bulb devices: %s",
			"bulb":    "  %s\n  #%s\n    Type:   %s\n    Color:  #%s\n    Bright: %s\n    On:     %s"
		}
	}
}